#### `terraform plan` Success
<details><summary>Show Output</summary>

```
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/foreign-language-reader/infrastructure/runs/run-x9nUNAXJkeuXHo3o

Waiting for the plan to start...

Terraform v0.14.3
Configuring remote state backend...
Initializing Terraform configuration...
module.infrastructure.module.content.random_password.elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.module.monitoring.random_password.fluent_elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.module.api.random_password.elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.module.database.random_password.database_admin_password: Refreshing state... [id=none]
module.infrastructure.module.api.random_password.truststore_password: Refreshing state... [id=none]
module.infrastructure.digitalocean_domain.main: Refreshing state... [id=foreignlanguagereader.com]
module.infrastructure.module.api.random_password.application_secret: Refreshing state... [id=none]
module.infrastructure.digitalocean_domain.fluentlabs: Refreshing state... [id=fluentlabs.io]
module.infrastructure.tls_private_key.tls_private_key: Refreshing state... [id=96c5128d225c1725a7d5fda91c9f195dd1837181]
module.infrastructure.module.content.random_password.truststore_password: Refreshing state... [id=none]
module.infrastructure.acme_registration.reg: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/acct/106949055]
module.infrastructure.acme_certificate.certificate: Refreshing state... [id=5b26b697-bd46-8986-882e-8d464a869dcd]
module.infrastructure.acme_certificate.certificate_fluent_labs: Refreshing state... [id=1f925157-0a72-7ffc-0dc5-688f3f39570f]
module.infrastructure.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:165140526436:certificate/6470664d-0acf-4b67-93a9-8430119af2fa]
module.infrastructure.module.frontend_preprod_fluent_labs.aws_s3_bucket.main: Refreshing state... [id=preprod.fluentlabs.io]
module.infrastructure.module.database.aws_db_instance.fluentlabs: Refreshing state... [id=fluentlabs]
module.infrastructure.aws_iam_user.github: Refreshing state... [id=foreign-language-reader-github]
module.infrastructure.module.nginx_ingress.aws_route53_zone.main: Refreshing state... [id=Z06930519E1ERX06IWP1]
module.infrastructure.module.content.aws_iam_user.spark: Refreshing state... [id=spark]
module.infrastructure.module.frontend_fluent_labs.aws_s3_bucket.main: Refreshing state... [id=www.fluentlabs.io]
module.kubernetes.aws_vpc.main: Refreshing state... [id=vpc-08c4330d865dc7409]
module.kubernetes.aws_iam_role.service_workers: Refreshing state... [id=eks-node-group-service]
module.kubernetes.aws_iam_role.eks_cluster_role: Refreshing state... [id=eks-cluster-role]
module.infrastructure.module.content.aws_iam_user.github: Refreshing state... [id=github-spark-deploy]
module.infrastructure.module.content.aws_s3_bucket.content: Refreshing state... [id=fluentlabs-content]
module.infrastructure.module.content.aws_iam_access_key.spark: Refreshing state... [id=AKIASM4ZEOVSEBHLP4HO]
module.infrastructure.aws_iam_access_key.github: Refreshing state... [id=AKIASM4ZEOVSADUQ77GK]
module.infrastructure.module.content.aws_iam_access_key.github: Refreshing state... [id=AKIASM4ZEOVSERLYTV5P]
module.kubernetes.aws_iam_role_policy_attachment.eks_vpc_controller: Refreshing state... [id=eks-cluster-role-20210718103605121000000002]
module.kubernetes.aws_iam_role_policy_attachment.eks_cluster_policy: Refreshing state... [id=eks-cluster-role-20210718103605118700000001]
module.kubernetes.aws_iam_role_policy_attachment.eks_container_read_policy: Refreshing state... [id=eks-node-group-service-20210718215214601100000001]
module.kubernetes.aws_iam_role_policy_attachment.eks_cni_policy_worker: Refreshing state... [id=eks-node-group-service-20210718103029423400000002]
module.kubernetes.aws_iam_role_policy_attachment.eks_worker_node_policy: Refreshing state... [id=eks-node-group-service-20210718103029414600000001]
module.infrastructure.module.nginx_ingress.helm_release.nginx_ingress: Refreshing state... [id=nginx-ingress]
module.infrastructure.module.monitoring.helm_release.sematext_logagent: Refreshing state... [id=sematext]
module.infrastructure.module.monitoring.helm_release.fluentd_elasticsearch: Refreshing state... [id=fluentd]
module.infrastructure.module.content.helm_release.spark: Refreshing state... [id=spark]
module.infrastructure.module.monitoring.helm_release.prometheus_operator: Refreshing state... [id=prometheus]
module.infrastructure.module.content.kubernetes_secret.spark_config: Refreshing state... [id=default/spark-config]
module.infrastructure.module.nginx_ingress.kubernetes_secret.nginx_certificate: Refreshing state... [id=default/nginx-certificate]
module.infrastructure.module.api.kubernetes_secret.application-secret: Refreshing state... [id=default/application-secret]
module.infrastructure.module.api.kubernetes_secret.api_database_credentials: Refreshing state... [id=default/api-database-credentials]
module.infrastructure.module.nginx_ingress.kubernetes_ingress.ingress: Refreshing state... [id=default/fluentlabs-ingress]
module.infrastructure.module.api.kubernetes_service.api: Refreshing state... [id=default/api]
module.infrastructure.module.language_service.kubernetes_service.language_service: Refreshing state... [id=default/language-service]
module.infrastructure.module.api.kubernetes_horizontal_pod_autoscaler.api_autoscale: Refreshing state... [id=default/api]
module.infrastructure.module.language_service.kubernetes_horizontal_pod_autoscaler.language_service_autoscale: Refreshing state... [id=default/language-service]
module.infrastructure.module.language_service.kubernetes_deployment.language_service: Refreshing state... [id=default/language-service]
module.infrastructure.module.api.kubernetes_secret.elasticsearch_credentials: Refreshing state... [id=default/elasticsearch-credentials]
module.kubernetes.aws_internet_gateway.gateway: Refreshing state... [id=igw-072010f2418cb3795]
module.kubernetes.aws_subnet.public[1]: Refreshing state... [id=subnet-0c64eade2a7db2bb4]
module.kubernetes.aws_subnet.public[0]: Refreshing state... [id=subnet-03d64ea688089e7e8]
module.kubernetes.aws_subnet.public[2]: Refreshing state... [id=subnet-09bfc938045329b49]
module.kubernetes.aws_route_table.route_table: Refreshing state... [id=rtb-05eec23c01822e230]
module.infrastructure.module.frontend_fluent_labs.aws_s3_bucket_policy.public_access: Refreshing state... [id=www.fluentlabs.io]
module.infrastructure.module.api.kubernetes_deployment.api: Refreshing state... [id=default/api]
module.infrastructure.module.frontend_preprod_fluent_labs.aws_s3_bucket_policy.public_access: Refreshing state... [id=preprod.fluentlabs.io]
module.infrastructure.module.frontend_fluent_labs.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=ERG8JFP6OLXF]
module.infrastructure.module.frontend_preprod_fluent_labs.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E32KMXMEZQQYJK]
module.kubernetes.aws_eks_cluster.fluentlabs: Refreshing state... [id=fluentlabsprod]
module.infrastructure.module.content.aws_iam_policy.spark_write: Refreshing state... [id=arn:aws:iam::165140526436:policy/spark-write-role]
module.infrastructure.module.content.aws_iam_policy.spark_read: Refreshing state... [id=arn:aws:iam::165140526436:policy/spark-read-role]
module.infrastructure.module.content.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::165140526436:policy/spark-deploy-role]
module.infrastructure.module.frontend_fluent_labs.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::165140526436:policy/www.fluentlabs.io-deploy-role]
module.kubernetes.aws_eks_addon.vpc_cni: Refreshing state... [id=fluentlabsprod:vpc-cni]
module.kubernetes.aws_eks_node_group.services: Refreshing state... [id=fluentlabsprod:services]
module.kubernetes.aws_eks_node_group.jobs: Refreshing state... [id=fluentlabsprod:jobs]
module.kubernetes.aws_eks_addon.kube_proxy: Refreshing state... [id=fluentlabsprod:kube-proxy]
module.kubernetes.aws_eks_addon.coredns: Refreshing state... [id=fluentlabsprod:coredns]
module.infrastructure.module.frontend_preprod_fluent_labs.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::165140526436:policy/preprod.fluentlabs.io-deploy-role]
module.infrastructure.module.content.aws_iam_policy_attachment.spark_read: Refreshing state... [id=spark-read-role-attach]
module.infrastructure.module.content.aws_iam_policy_attachment.deploy: Refreshing state... [id=spark-deploy-role-attach]
module.infrastructure.module.content.aws_iam_policy_attachment.spark_write: Refreshing state... [id=spark-write-role-attach]
module.infrastructure.module.frontend_fluent_labs.aws_iam_policy_attachment.deploy: Refreshing state... [id=www.fluentlabs.io-deploy-role-attach]
module.infrastructure.module.frontend_preprod_fluent_labs.aws_iam_policy_attachment.deploy: Refreshing state... [id=preprod.fluentlabs.io-deploy-role-attach]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.infrastructure.module.api.kubernetes_deployment.api is tainted, so must be replaced
-/+ resource "kubernetes_deployment" "api" {
      ~ id               = "default/api" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 1 -> (known after apply)
          - labels           = {} -> null
            name             = "api"
          ~ resource_version = "948591" -> (known after apply)
          + self_link        = (known after apply)
          ~ uid              = "c907a2d5-9383-46e1-bbb8-194cc458a311" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ spec {
          ~ replicas                  = "1" -> (known after apply)
            # (4 unchanged attributes hidden)


          ~ strategy {
              ~ type = "RollingUpdate" -> (known after apply)

              ~ rolling_update {
                  ~ max_surge       = "25%" -> (known after apply)
                  ~ max_unavailable = "25%" -> (known after apply)
                }
            }

          ~ template {
              ~ metadata {
                  - annotations      = {} -> null
                  ~ generation       = 0 -> (known after apply)
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + self_link        = (known after apply)
                  + uid              = (known after apply)
                    # (1 unchanged attribute hidden)
                }

              ~ spec {
                  - active_deadline_seconds          = 0 -> null
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  - node_selector                    = {} -> null
                  + service_account_name             = (known after apply)
                    # (9 unchanged attributes hidden)

                  ~ container {
                      - args                       = [] -> null
                      - command                    = [] -> null
                      ~ image_pull_policy          = "IfNotPresent" -> (known after apply)
                        name                       = "api"
                      ~ termination_message_policy = "File" -> (known after apply)
                        # (5 unchanged attributes hidden)

                      ~ env {
                            name = "APPLICATION_SECRET"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "application-secret"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "WEBSTER_LEARNERS_KEY"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "webster"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "WEBSTER_SPANISH_KEY"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "webster"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "ELASTICSEARCH_PASSWORD"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "elasticsearch-credentials"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "DATABASE_URL"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "api-database-credentials"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "DATABASE_USERNAME"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "api-database-credentials"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "DATABASE_PASSWORD"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "api-database-credentials"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "AUTH0_AUDIENCE"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "auth0"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "AUTH0_DOMAIN"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "auth0"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }

                      ~ liveness_probe {
                            # (5 unchanged attributes hidden)

                          ~ http_get {
                                # (3 unchanged attributes hidden)
                            }
                        }

                      ~ port {
                          - host_port      = 0 -> null
                            # (2 unchanged attributes hidden)
                        }

                      ~ readiness_probe {
                            # (5 unchanged attributes hidden)

                          ~ http_get {
                                # (3 unchanged attributes hidden)
                            }
                        }


                      ~ volume_mount {
                            name              = "flrcredentials"
                            # (3 unchanged attributes hidden)
                        }
                        # (3 unchanged blocks hidden)
                    }

                  + image_pull_secrets {
                      + name = (known after apply)
                    }

                  + readiness_gate {
                      + condition_type = (known after apply)
                    }

                  ~ volume {
                        name = "flrcredentials"

                      ~ secret {
                          - optional     = false -> null
                            # (2 unchanged attributes hidden)
                        }
                    }
                }
            }
            # (1 unchanged block hidden)
        }
    }

  # module.infrastructure.module.nginx_ingress.aws_route53_record.subdomain["api"] will be created
  + resource "aws_route53_record" "subdomain" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api.fluentlabs.io"
      + records         = [
          + "a31340d1a330b41e8bfbb0d179af47ec-177610128.us-west-2.elb.amazonaws.com",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z06930519E1ERX06IWP1"
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `__hashicorp_terraform-github-actions_4`, Working Directory: `.`, Workspace: `default`*
